### Learning to handle missing data
```text
SEARCH ---> .isna   column wise selection
REMOVE ---> .dropna row wise selection
FILL   ---> .fillna column wise selection
```

In [1]:
import numpy as np 
import pandas as pd

#### Finding Missing Data

In [42]:
data = {
    'A':[1,2,3,np.nan,5],
    'B':[1,2,3,4,5],
    'C':[1,np.nan,3,np.nan,np.nan],
    'D':[1,2,np.nan,np.nan,5]
}
df = pd.DataFrame(data)
df
#np.nan means null value(nan--> not a number)

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  NaN  2.0
2  3.0  3  3.0  NaN
3  NaN  4  NaN  NaN
4  5.0  5  NaN  5.0

In [21]:
df.isna() ## df.isna is used to check if there are null values in the data frame if there are it reeturns true in that place and false wherever there is not null
df.isna().sum() #used to find which row has the most null values
df.isna().any() ## returns true if the columns has even one null value and false if the column has no null values
#in our case it returned true for all columns that means each columns have a null value

A     True
B    False
C     True
D     True
dtype: bool

#### Removing Missing Data

In [ ]:
#removing missing data works on row basis
df.dropna()#removes a row that contains null value
df.dropna(thresh=3)#thresh means remove those rows which does not have atlest 3 non-null values

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  NaN  2.0
2  3.0  3  3.0  NaN
4  5.0  5  NaN  5.0

#### Filling the missing data

In [24]:
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  NaN  2.0
2  3.0  3  3.0  NaN
3  NaN  4  NaN  NaN
4  5.0  5  NaN  5.0

In [ ]:
# df.fillna(0)#fills all the null values by 0
# #to make permanent change in the data
# df.fillna(0,inplace=True)
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  0.0  2.0
2  3.0  3  3.0  0.0
3  0.0  4  0.0  0.0
4  5.0  5  0.0  5.0

In [48]:
## fill missing values with different values for each column
#we create a dictionary with values according to columns
# values = {'A':0,'B':10,'C':200,'D':400}
# df.fillna(value=values,inplace=True)
# df

#fill with mean
df.fillna(df.mean())

      A  B    C         D
0  1.00  1  1.0  1.000000
1  2.00  2  2.0  2.000000
2  3.00  3  3.0  2.666667
3  2.75  4  2.0  2.666667
4  5.00  5  2.0  5.000000